import numpy as np
import scipy.cluster.hierarchy as sch
import matplotlib.pyplot as plt

# 成績データ（すべて2次元リストに統一）
data = np.array([
   #[英語,国語], #被験者番号
    [50, 90],   # J1-01
    [35, 70],   # J1-02
    [100, 70],  # J2-01
    [90, 90],   # J2-02
    [95, 80],   # J2-03
    [70, 90],   # J2-04
    [55, 60],   # J2-05
    [85, 80],   # J2-06
    [55, 80],   # J2-07
    [75, 90],   # J2-08
    [65, 80],   # J2-09
    [90, 90],   # J2-10
    [20, 80],   # J3-01
    [20, 100],  # J3-02
    [20, 80],   # J3-03
    [30, 90],   # J3-04
    [25, 90],   # J3-05
    [20, 90],   # J3-06
    [25, 100],  # J3-07
    [25, 100],  # J3-08
    [20, 90],   # J3-09
    [10, 90],   # J3-10
    [5, 100],   # J3-11
    [15, 100],  # J3-12
    [10, 70],   # J3-13
    [10, 90],   # J3-14
    [90, 90],   # H1-01
    [80, 80],   # H1-02
    [100, 100], # H2-01
    [90, 90],   # H2-02
    [80, 80],   # H2-03
    [100, 100], # H3-02
])

# 距離行列の計算（ユークリッド距離）
Z = sch.linkage(data, method='average')  # 'average'は平均リンク法

# デンドログラムの描画
plt.figure(figsize=(10, 7))
sch.dendrogram(Z, labels=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32'])
plt.xlabel('Participant')
plt.ylabel('Distance')
plt.show()