import numpy as np
import scipy.cluster.hierarchy as sch
import matplotlib.pyplot as plt

# 成績データ（すべて2次元リストに統一）
data = np.array([
   #[英語,国語], #被験者番号
    [50, 90],   # J1-01
    [35, 70],   # J1-02
    [100, 70],  # J2-01
    [90, 90],   # J2-02
    [95, 80],   # J2-03
    [70, 90],   # J2-04
    [55, 60],   # J2-05
    [85, 80],   # J2-06
    [55, 80],   # J2-07
    [75, 90],   # J2-08
    [65, 80],   # J2-09
    [90, 90],   # J2-10
    [20, 80],   # J3-01
    [20, 100],  # J3-02
    [20, 80],   # J3-03
    [30, 90],   # J3-04
    [25, 90],   # J3-05
    [20, 90],   # J3-06
    [25, 100],  # J3-07
    [25, 100],  # J3-08
    [20, 90],   # J3-09
    [10, 90],   # J3-10
    [5, 100],   # J3-11
    [15, 100],  # J3-12
    [10, 70],   # J3-13
    [10, 90],   # J3-14
    [90, 90],   # H1-01
    [80, 80],   # H1-02
    [100, 100], # H2-01
    [90, 90],   # H2-02
    [80, 80],   # H2-03
    [100, 100], # H3-01
])

# 距離行列の計算（ユークリッド距離）
Z = sch.linkage(data, method='average')  # 'average'は平均リンク法

# デンドログラムの描画
plt.figure(figsize=(10, 7))
sch.dendrogram(Z, labels=['J1-01', 'J1-02', 'J2-01', 'J2-02', 'J2-03', 'J2-04', 'J2-05', 'J2-06', 'J2-07', 'J2-08', 'J2-09', 'J2-010', 'J3-01', 'J3-02', 'J3-03',
                           'J3-04', 'J3-05', 'J3-06', 'J3-07', 'J3-08', 'J3-09', 'J3-010', 'J3-011', 'J3-012', 'J3-013', 'J3-014', 'H1-01', 'H1-02', 'H2-01', 'H2-02', 'H2-03', 'H3-01'])
plt.xlabel('Participant')
plt.ylabel('Distance')
plt.show()